Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_tcp_client/src/packs/WBZ653_DFP/component/silex.h
/* -------- SILEX_DMA_INT_STATRAW : (SILEX Offset: 0x28) ( R/ 32)  -------- */
#define SILEX_DMA_INT_STATRAW_RESETVALUE      _UINT32_(0x00)                                       /*  (SILEX_DMA_INT_STATRAW)   Reset Value */

#define SILEX_DMA_INT_STATRAW_INT_STATRAW_Pos _UINT32_(0)                                          /* (SILEX_DMA_INT_STATRAW)  Position */
#define SILEX_DMA_INT_STATRAW_INT_STATRAW_Msk (_UINT32_(0xFFFFFFFF) << SILEX_DMA_INT_STATRAW_INT_STATRAW_Pos) /* (SILEX_DMA_INT_STATRAW)  Mask */
#define SILEX_DMA_INT_STATRAW_INT_STATRAW(value) (SILEX_DMA_INT_STATRAW_INT_STATRAW_Msk & (_UINT32_(value) << SILEX_DMA_INT_STATRAW_INT_STATRAW_Pos)) /* Assigment of value for INT_STATRAW in the SILEX_DMA_INT_STATRAW register */
#define SILEX_DMA_INT_STATRAW_Msk             _UINT32_(0xFFFFFFFF)                                 /* (SILEX_DMA_INT_STATRAW) Register Mask  */


/* -------- SILEX_DMA_INT_STAT : (SILEX Offset: 0x2C) ( R/ 32)  -------- */
#define SILEX_DMA_INT_STAT_RESETVALUE         _UINT32_(0x00)                                       /*  (SILEX_DMA_INT_STAT)   Reset Value */

#define SILEX_DMA_INT_STAT_INT_STAT_Pos       _UINT32_(0)                                          /* (SILEX_DMA_INT_STAT)  Position */
#define SILEX_DMA_INT_STAT_INT_STAT_Msk       (_UINT32_(0xFFFFFFFF) << SILEX_DMA_INT_STAT_INT_STAT_Pos) /* (SILEX_DMA_INT_STAT)  Mask */
#define SILEX_DMA_INT_STAT_INT_STAT(value)    (SILEX_DMA_INT_STAT_INT_STAT_Msk & (_UINT32_(value) << SILEX_DMA_INT_STAT_INT_STAT_Pos)) /* Assigment of value for INT_STAT in the SILEX_DMA_INT_STAT register */
#define SILEX_DMA_INT_STAT_Msk                _UINT32_(0xFFFFFFFF)                                 /* (SILEX_DMA_INT_STAT) Register Mask  */


/* -------- SILEX_DMA_INT_STATCLR : (SILEX Offset: 0x30) ( /W 32)  -------- */
#define SILEX_DMA_INT_STATCLR_RESETVALUE      _UINT32_(0x00)                                       /*  (SILEX_DMA_INT_STATCLR)   Reset Value */

#define SILEX_DMA_INT_STATCLR_INT_STATCLR_Pos _UINT32_(0)                                          /* (SILEX_DMA_INT_STATCLR)  Position */
#define SILEX_DMA_INT_STATCLR_INT_STATCLR_Msk (_UINT32_(0xFFFFFFFF) << SILEX_DMA_INT_STATCLR_INT_STATCLR_Pos) /* (SILEX_DMA_INT_STATCLR)  Mask */
#define SILEX_DMA_INT_STATCLR_INT_STATCLR(value) (SILEX_DMA_INT_STATCLR_INT_STATCLR_Msk & (_UINT32_(value) << SILEX_DMA_INT_STATCLR_INT_STATCLR_Pos)) /* Assigment of value for INT_STATCLR in the SILEX_DMA_INT_STATCLR register */
#define SILEX_DMA_INT_STATCLR_Msk             _UINT32_(0xFFFFFFFF)                                 /* (SILEX_DMA_INT_STATCLR) Register Mask  */


/* -------- SILEX_DMA_CONFIG : (SILEX Offset: 0x34) (R/W 32)  -------- */
#define SILEX_DMA_CONFIG_RESETVALUE           _UINT32_(0x00)                                       /*  (SILEX_DMA_CONFIG)   Reset Value */

#define SILEX_DMA_CONFIG_FETCH_CTRL_INDIRECT_Pos _UINT32_(0)                                          /* (SILEX_DMA_CONFIG)  Position */
#define SILEX_DMA_CONFIG_FETCH_CTRL_INDIRECT_Msk (_UINT32_(0x1) << SILEX_DMA_CONFIG_FETCH_CTRL_INDIRECT_Pos) /* (SILEX_DMA_CONFIG)  Mask */
#define SILEX_DMA_CONFIG_FETCH_CTRL_INDIRECT(value) (SILEX_DMA_CONFIG_FETCH_CTRL_INDIRECT_Msk & (_UINT32_(value) << SILEX_DMA_CONFIG_FETCH_CTRL_INDIRECT_Pos)) /* Assigment of value for FETCH_CTRL_INDIRECT in the SILEX_DMA_CONFIG register */
#define SILEX_DMA_CONFIG_PUSH_CTRL_INDIRECT_Pos _UINT32_(1)                                          /* (SILEX_DMA_CONFIG)  Position */
#define SILEX_DMA_CONFIG_PUSH_CTRL_INDIRECT_Msk (_UINT32_(0x1) << SILEX_DMA_CONFIG_PUSH_CTRL_INDIRECT_Pos) /* (SILEX_DMA_CONFIG)  Mask */
#define SILEX_DMA_CONFIG_PUSH_CTRL_INDIRECT(value) (SILEX_DMA_CONFIG_PUSH_CTRL_INDIRECT_Msk & (_UINT32_(value) << SILEX_DMA_CONFIG_PUSH_CTRL_INDIRECT_Pos)) /* Assigment of value for PUSH_CTRL_INDIRECT in the SILEX_DMA_CONFIG register */
#define SILEX_DMA_CONFIG_FETCH_STOP_Pos       _UINT32_(2)                                          /* (SILEX_DMA_CONFIG)  Position */
#define SILEX_DMA_CONFIG_FETCH_STOP_Msk       (_UINT32_(0x1) << SILEX_DMA_CONFIG_FETCH_STOP_Pos)   /* (SILEX_DMA_CONFIG)  Mask */
#define SILEX_DMA_CONFIG_FETCH_STOP(value)    (SILEX_DMA_CONFIG_FETCH_STOP_Msk & (_UINT32_(value) << SILEX_DMA_CONFIG_FETCH_STOP_Pos)) /* Assigment of value for FETCH_STOP in the SILEX_DMA_CONFIG register */
#define SILEX_DMA_CONFIG_PUSH_STOP_Pos        _UINT32_(3)                                          /* (SILEX_DMA_CONFIG)  Position */
#define SILEX_DMA_CONFIG_PUSH_STOP_Msk        (_UINT32_(0x1) << SILEX_DMA_CONFIG_PUSH_STOP_Pos)    /* (SILEX_DMA_CONFIG)  Mask */
#define SILEX_DMA_CONFIG_PUSH_STOP(value)     (SILEX_DMA_CONFIG_PUSH_STOP_Msk & (_UINT32_(value) << SILEX_DMA_CONFIG_PUSH_STOP_Pos)) /* Assigment of value for PUSH_STOP in the SILEX_DMA_CONFIG register */
#define SILEX_DMA_CONFIG_SOFT_RST_Pos         _UINT32_(4)                                          /* (SILEX_DMA_CONFIG)  Position */
#define SILEX_DMA_CONFIG_SOFT_RST_Msk         (_UINT32_(0x1) << SILEX_DMA_CONFIG_SOFT_RST_Pos)     /* (SILEX_DMA_CONFIG)  Mask */
#define SILEX_DMA_CONFIG_SOFT_RST(value)      (SILEX_DMA_CONFIG_SOFT_RST_Msk & (_UINT32_(value) << SILEX_DMA_CONFIG_SOFT_RST_Pos)) /* Assigment of value for SOFT_RST in the SILEX_DMA_CONFIG register */
#define SILEX_DMA_CONFIG_Msk                  _UINT32_(0x0000001F)                                 /* (SILEX_DMA_CONFIG) Register Mask  */


/* -------- SILEX_DMA_START : (SILEX Offset: 0x38) ( /W 32)  -------- */
#define SILEX_DMA_START_RESETVALUE            _UINT32_(0x00)                                       /*  (SILEX_DMA_START)   Reset Value */

#define SILEX_DMA_START_START_FETCH_Pos       _UINT32_(0)                                          /* (SILEX_DMA_START)  Position */
#define SILEX_DMA_START_START_FETCH_Msk       (_UINT32_(0x1) << SILEX_DMA_START_START_FETCH_Pos)   /* (SILEX_DMA_START)  Mask */
#define SILEX_DMA_START_START_FETCH(value)    (SILEX_DMA_START_START_FETCH_Msk & (_UINT32_(value) << SILEX_DMA_START_START_FETCH_Pos)) /* Assigment of value for START_FETCH in the SILEX_DMA_START register */
#define SILEX_DMA_START_START_PUSH_Pos        _UINT32_(1)                                          /* (SILEX_DMA_START)  Position */
#define SILEX_DMA_START_START_PUSH_Msk        (_UINT32_(0x1) << SILEX_DMA_START_START_PUSH_Pos)    /* (SILEX_DMA_START)  Mask */
#define SILEX_DMA_START_START_PUSH(value)     (SILEX_DMA_START_START_PUSH_Msk & (_UINT32_(value) << SILEX_DMA_START_START_PUSH_Pos)) /* Assigment of value for START_PUSH in the SILEX_DMA_START register */
#define SILEX_DMA_START_Msk                   _UINT32_(0x00000003)                                 /* (SILEX_DMA_START) Register Mask  */


/* -------- SILEX_DMA_STATUS : (SILEX Offset: 0x3C) ( R/ 32)  -------- */
#define SILEX_DMA_STATUS_RESETVALUE           _UINT32_(0x00)                                       /*  (SILEX_DMA_STATUS)   Reset Value */

#define SILEX_DMA_STATUS_FETCH_BUSY_Pos       _UINT32_(0)                                          /* (SILEX_DMA_STATUS)  Position */
#define SILEX_DMA_STATUS_FETCH_BUSY_Msk       (_UINT32_(0x1) << SILEX_DMA_STATUS_FETCH_BUSY_Pos)   /* (SILEX_DMA_STATUS)  Mask */
#define SILEX_DMA_STATUS_FETCH_BUSY(value)    (SILEX_DMA_STATUS_FETCH_BUSY_Msk & (_UINT32_(value) << SILEX_DMA_STATUS_FETCH_BUSY_Pos)) /* Assigment of value for FETCH_BUSY in the SILEX_DMA_STATUS register */
#define SILEX_DMA_STATUS_PUSH_BUSY_Pos        _UINT32_(1)                                          /* (SILEX_DMA_STATUS)  Position */
#define SILEX_DMA_STATUS_PUSH_BUSY_Msk        (_UINT32_(0x1) << SILEX_DMA_STATUS_PUSH_BUSY_Pos)    /* (SILEX_DMA_STATUS)  Mask */
#define SILEX_DMA_STATUS_PUSH_BUSY(value)     (SILEX_DMA_STATUS_PUSH_BUSY_Msk & (_UINT32_(value) << SILEX_DMA_STATUS_PUSH_BUSY_Pos)) /* Assigment of value for PUSH_BUSY in the SILEX_DMA_STATUS register */
#define SILEX_DMA_STATUS_FETCH_NOT_EMPTY_Pos  _UINT32_(4)                                          /* (SILEX_DMA_STATUS)  Position */
#define SILEX_DMA_STATUS_FETCH_NOT_EMPTY_Msk  (_UINT32_(0x1) << SILEX_DMA_STATUS_FETCH_NOT_EMPTY_Pos) /* (SILEX_DMA_STATUS)  Mask */
#define SILEX_DMA_STATUS_FETCH_NOT_EMPTY(value) (SILEX_DMA_STATUS_FETCH_NOT_EMPTY_Msk & (_UINT32_(value) << SILEX_DMA_STATUS_FETCH_NOT_EMPTY_Pos)) /* Assigment of value for FETCH_NOT_EMPTY in the SILEX_DMA_STATUS register */
#define SILEX_DMA_STATUS_PUSH_WAITINGFIFO_Pos _UINT32_(5)                                          /* (SILEX_DMA_STATUS)  Position */
#define SILEX_DMA_STATUS_PUSH_WAITINGFIFO_Msk (_UINT32_(0x1) << SILEX_DMA_STATUS_PUSH_WAITINGFIFO_Pos) /* (SILEX_DMA_STATUS)  Mask */
#define SILEX_DMA_STATUS_PUSH_WAITINGFIFO(value) (SILEX_DMA_STATUS_PUSH_WAITINGFIFO_Msk & (_UINT32_(value) << SILEX_DMA_STATUS_PUSH_WAITINGFIFO_Pos)) /* Assigment of value for PUSH_WAITINGFIFO in the SILEX_DMA_STATUS register */
#define SILEX_DMA_STATUS_SOFT_RST_BUSY_Pos    _UINT32_(6)                                          /* (SILEX_DMA_STATUS)  Position */
#define SILEX_DMA_STATUS_SOFT_RST_BUSY_Msk    (_UINT32_(0x1) << SILEX_DMA_STATUS_SOFT_RST_BUSY_Pos) /* (SILEX_DMA_STATUS)  Mask */
#define SILEX_DMA_STATUS_SOFT_RST_BUSY(value) (SILEX_DMA_STATUS_SOFT_RST_BUSY_Msk & (_UINT32_(value) << SILEX_DMA_STATUS_SOFT_RST_BUSY_Pos)) /* Assigment of value for SOFT_RST_BUSY in the SILEX_DMA_STATUS register */
#define SILEX_DMA_STATUS_PUSH_NBDATA_Pos      _UINT32_(16)                                         /* (SILEX_DMA_STATUS)  Position */
#define SILEX_DMA_STATUS_PUSH_NBDATA_Msk      (_UINT32_(0xFFFF) << SILEX_DMA_STATUS_PUSH_NBDATA_Pos) /* (SILEX_DMA_STATUS)  Mask */
#define SILEX_DMA_STATUS_PUSH_NBDATA(value)   (SILEX_DMA_STATUS_PUSH_NBDATA_Msk & (_UINT32_(value) << SILEX_DMA_STATUS_PUSH_NBDATA_Pos)) /* Assigment of value for PUSH_NBDATA in the SILEX_DMA_STATUS register */
#define SILEX_DMA_STATUS_Msk                  _UINT32_(0xFFFF0073)                                 /* (SILEX_DMA_STATUS) Register Mask  */


/* -------- SILEX_HWCONF_INCL_IPS_HW_CFG : (SILEX Offset: 0x400) ( R/ 32)  -------- */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_RESETVALUE _UINT32_(0x00)                                       /*  (SILEX_HWCONF_INCL_IPS_HW_CFG)   Reset Value */

