Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_tcp_client/src/packs/WBZ653_DFP/component/silex.h
#define SILEX_HWCONF_INCL_IPS_HW_CFG_BA411_AES_INCLUDED_Pos _UINT32_(0)                                          /* (SILEX_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeAES value. BA411E-AES IP included if set Position */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_BA411_AES_INCLUDED_Msk (_UINT32_(0x1) << SILEX_HWCONF_INCL_IPS_HW_CFG_BA411_AES_INCLUDED_Pos) /* (SILEX_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeAES value. BA411E-AES IP included if set Mask */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_BA411_AES_INCLUDED(value) (SILEX_HWCONF_INCL_IPS_HW_CFG_BA411_AES_INCLUDED_Msk & (_UINT32_(value) << SILEX_HWCONF_INCL_IPS_HW_CFG_BA411_AES_INCLUDED_Pos)) /* Assigment of value for BA411_AES_INCLUDED in the SILEX_HWCONF_INCL_IPS_HW_CFG register */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_BA415_HP_AES_GCM_INCLUDED_Pos _UINT32_(1)                                          /* (SILEX_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeAESGCM value. BA415-HP-AES-GCM IP included if set Position */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_BA415_HP_AES_GCM_INCLUDED_Msk (_UINT32_(0x1) << SILEX_HWCONF_INCL_IPS_HW_CFG_BA415_HP_AES_GCM_INCLUDED_Pos) /* (SILEX_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeAESGCM value. BA415-HP-AES-GCM IP included if set Mask */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_BA415_HP_AES_GCM_INCLUDED(value) (SILEX_HWCONF_INCL_IPS_HW_CFG_BA415_HP_AES_GCM_INCLUDED_Msk & (_UINT32_(value) << SILEX_HWCONF_INCL_IPS_HW_CFG_BA415_HP_AES_GCM_INCLUDED_Pos)) /* Assigment of value for BA415_HP_AES_GCM_INCLUDED in the SILEX_HWCONF_INCL_IPS_HW_CFG register */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_BA416_HP_AES_XTS_INCLUDED_Pos _UINT32_(2)                                          /* (SILEX_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeAESXTS value. BA416-HP-AES-XTS IP included if set Position */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_BA416_HP_AES_XTS_INCLUDED_Msk (_UINT32_(0x1) << SILEX_HWCONF_INCL_IPS_HW_CFG_BA416_HP_AES_XTS_INCLUDED_Pos) /* (SILEX_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeAESXTS value. BA416-HP-AES-XTS IP included if set Mask */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_BA416_HP_AES_XTS_INCLUDED(value) (SILEX_HWCONF_INCL_IPS_HW_CFG_BA416_HP_AES_XTS_INCLUDED_Msk & (_UINT32_(value) << SILEX_HWCONF_INCL_IPS_HW_CFG_BA416_HP_AES_XTS_INCLUDED_Pos)) /* Assigment of value for BA416_HP_AES_XTS_INCLUDED in the SILEX_HWCONF_INCL_IPS_HW_CFG register */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_BA412_DES_INCLUDED_Pos _UINT32_(3)                                          /* (SILEX_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeDES value. BA412-3DES IP included if set Position */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_BA412_DES_INCLUDED_Msk (_UINT32_(0x1) << SILEX_HWCONF_INCL_IPS_HW_CFG_BA412_DES_INCLUDED_Pos) /* (SILEX_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeDES value. BA412-3DES IP included if set Mask */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_BA412_DES_INCLUDED(value) (SILEX_HWCONF_INCL_IPS_HW_CFG_BA412_DES_INCLUDED_Msk & (_UINT32_(value) << SILEX_HWCONF_INCL_IPS_HW_CFG_BA412_DES_INCLUDED_Pos)) /* Assigment of value for BA412_DES_INCLUDED in the SILEX_HWCONF_INCL_IPS_HW_CFG register */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_BA413_HASH_INCLUDED_Pos _UINT32_(4)                                          /* (SILEX_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeHASH value. BA413-HASH IP included if set Position */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_BA413_HASH_INCLUDED_Msk (_UINT32_(0x1) << SILEX_HWCONF_INCL_IPS_HW_CFG_BA413_HASH_INCLUDED_Pos) /* (SILEX_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeHASH value. BA413-HASH IP included if set Mask */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_BA413_HASH_INCLUDED(value) (SILEX_HWCONF_INCL_IPS_HW_CFG_BA413_HASH_INCLUDED_Msk & (_UINT32_(value) << SILEX_HWCONF_INCL_IPS_HW_CFG_BA413_HASH_INCLUDED_Pos)) /* Assigment of value for BA413_HASH_INCLUDED in the SILEX_HWCONF_INCL_IPS_HW_CFG register */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_BA417_CHACHAPOLY_INCLUDED_Pos _UINT32_(5)                                          /* (SILEX_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeChachaPoly value. BA417-ChaChaPoly IP included if set Position */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_BA417_CHACHAPOLY_INCLUDED_Msk (_UINT32_(0x1) << SILEX_HWCONF_INCL_IPS_HW_CFG_BA417_CHACHAPOLY_INCLUDED_Pos) /* (SILEX_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeChachaPoly value. BA417-ChaChaPoly IP included if set Mask */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_BA417_CHACHAPOLY_INCLUDED(value) (SILEX_HWCONF_INCL_IPS_HW_CFG_BA417_CHACHAPOLY_INCLUDED_Msk & (_UINT32_(value) << SILEX_HWCONF_INCL_IPS_HW_CFG_BA417_CHACHAPOLY_INCLUDED_Pos)) /* Assigment of value for BA417_CHACHAPOLY_INCLUDED in the SILEX_HWCONF_INCL_IPS_HW_CFG register */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_BA418_SHA3_INCLUDED_Pos _UINT32_(6)                                          /* (SILEX_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeSHA3  value. BA418-SHA3 IP included if set Position */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_BA418_SHA3_INCLUDED_Msk (_UINT32_(0x1) << SILEX_HWCONF_INCL_IPS_HW_CFG_BA418_SHA3_INCLUDED_Pos) /* (SILEX_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeSHA3  value. BA418-SHA3 IP included if set Mask */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_BA418_SHA3_INCLUDED(value) (SILEX_HWCONF_INCL_IPS_HW_CFG_BA418_SHA3_INCLUDED_Msk & (_UINT32_(value) << SILEX_HWCONF_INCL_IPS_HW_CFG_BA418_SHA3_INCLUDED_Pos)) /* Assigment of value for BA418_SHA3_INCLUDED in the SILEX_HWCONF_INCL_IPS_HW_CFG register */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_BA421_ZUC_INCLUDED_Pos _UINT32_(7)                                          /* (SILEX_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeZUC  value. BA421-ZUC IP included if set Position */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_BA421_ZUC_INCLUDED_Msk (_UINT32_(0x1) << SILEX_HWCONF_INCL_IPS_HW_CFG_BA421_ZUC_INCLUDED_Pos) /* (SILEX_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeZUC  value. BA421-ZUC IP included if set Mask */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_BA421_ZUC_INCLUDED(value) (SILEX_HWCONF_INCL_IPS_HW_CFG_BA421_ZUC_INCLUDED_Msk & (_UINT32_(value) << SILEX_HWCONF_INCL_IPS_HW_CFG_BA421_ZUC_INCLUDED_Pos)) /* Assigment of value for BA421_ZUC_INCLUDED in the SILEX_HWCONF_INCL_IPS_HW_CFG register */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_BA419_SM4_INCLUDED_Pos _UINT32_(8)                                          /* (SILEX_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeSM4  value. BA419-SM4 IP included if set Position */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_BA419_SM4_INCLUDED_Msk (_UINT32_(0x1) << SILEX_HWCONF_INCL_IPS_HW_CFG_BA419_SM4_INCLUDED_Pos) /* (SILEX_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeSM4  value. BA419-SM4 IP included if set Mask */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_BA419_SM4_INCLUDED(value) (SILEX_HWCONF_INCL_IPS_HW_CFG_BA419_SM4_INCLUDED_Msk & (_UINT32_(value) << SILEX_HWCONF_INCL_IPS_HW_CFG_BA419_SM4_INCLUDED_Pos)) /* Assigment of value for BA419_SM4_INCLUDED in the SILEX_HWCONF_INCL_IPS_HW_CFG register */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_BA414EP_PKE_INCLUDED_Pos _UINT32_(9)                                          /* (SILEX_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludePKE  value. BA414EP-PKE IP included if set Position */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_BA414EP_PKE_INCLUDED_Msk (_UINT32_(0x1) << SILEX_HWCONF_INCL_IPS_HW_CFG_BA414EP_PKE_INCLUDED_Pos) /* (SILEX_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludePKE  value. BA414EP-PKE IP included if set Mask */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_BA414EP_PKE_INCLUDED(value) (SILEX_HWCONF_INCL_IPS_HW_CFG_BA414EP_PKE_INCLUDED_Msk & (_UINT32_(value) << SILEX_HWCONF_INCL_IPS_HW_CFG_BA414EP_PKE_INCLUDED_Pos)) /* Assigment of value for BA414EP_PKE_INCLUDED in the SILEX_HWCONF_INCL_IPS_HW_CFG register */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_BA431_NDRNG_INCLUDED_Pos _UINT32_(10)                                         /* (SILEX_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeNDRNG  value. BA431-NDRNG IP included if set Position */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_BA431_NDRNG_INCLUDED_Msk (_UINT32_(0x1) << SILEX_HWCONF_INCL_IPS_HW_CFG_BA431_NDRNG_INCLUDED_Pos) /* (SILEX_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeNDRNG  value. BA431-NDRNG IP included if set Mask */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_BA431_NDRNG_INCLUDED(value) (SILEX_HWCONF_INCL_IPS_HW_CFG_BA431_NDRNG_INCLUDED_Msk & (_UINT32_(value) << SILEX_HWCONF_INCL_IPS_HW_CFG_BA431_NDRNG_INCLUDED_Pos)) /* Assigment of value for BA431_NDRNG_INCLUDED in the SILEX_HWCONF_INCL_IPS_HW_CFG register */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_BA420_HP_CHACHAPOLY_INCLUDED_Pos _UINT32_(11)                                         /* (SILEX_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeHPChachaPoly  value. BA420-HP-ChaChaPoly IP included if set Position */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_BA420_HP_CHACHAPOLY_INCLUDED_Msk (_UINT32_(0x1) << SILEX_HWCONF_INCL_IPS_HW_CFG_BA420_HP_CHACHAPOLY_INCLUDED_Pos) /* (SILEX_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeHPChachaPoly  value. BA420-HP-ChaChaPoly IP included if set Mask */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_BA420_HP_CHACHAPOLY_INCLUDED(value) (SILEX_HWCONF_INCL_IPS_HW_CFG_BA420_HP_CHACHAPOLY_INCLUDED_Msk & (_UINT32_(value) << SILEX_HWCONF_INCL_IPS_HW_CFG_BA420_HP_CHACHAPOLY_INCLUDED_Pos)) /* Assigment of value for BA420_HP_CHACHAPOLY_INCLUDED in the SILEX_HWCONF_INCL_IPS_HW_CFG register */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_BA423_SNOW3G_INCLUDED_Pos _UINT32_(12)                                         /* (SILEX_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeSnow3G  value. BA423-Snow3G IP included if set Position */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_BA423_SNOW3G_INCLUDED_Msk (_UINT32_(0x1) << SILEX_HWCONF_INCL_IPS_HW_CFG_BA423_SNOW3G_INCLUDED_Pos) /* (SILEX_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeSnow3G  value. BA423-Snow3G IP included if set Mask */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_BA423_SNOW3G_INCLUDED(value) (SILEX_HWCONF_INCL_IPS_HW_CFG_BA423_SNOW3G_INCLUDED_Msk & (_UINT32_(value) << SILEX_HWCONF_INCL_IPS_HW_CFG_BA423_SNOW3G_INCLUDED_Pos)) /* Assigment of value for BA423_SNOW3G_INCLUDED in the SILEX_HWCONF_INCL_IPS_HW_CFG register */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_BA422_KASUMI_INCLUDED_Pos _UINT32_(13)                                         /* (SILEX_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeKasumi  value. BA422-Kasumi IP included if set Position */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_BA422_KASUMI_INCLUDED_Msk (_UINT32_(0x1) << SILEX_HWCONF_INCL_IPS_HW_CFG_BA422_KASUMI_INCLUDED_Pos) /* (SILEX_HWCONF_INCL_IPS_HW_CFG) Generic g_IncludeKasumi  value. BA422-Kasumi IP included if set Mask */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_BA422_KASUMI_INCLUDED(value) (SILEX_HWCONF_INCL_IPS_HW_CFG_BA422_KASUMI_INCLUDED_Msk & (_UINT32_(value) << SILEX_HWCONF_INCL_IPS_HW_CFG_BA422_KASUMI_INCLUDED_Pos)) /* Assigment of value for BA422_KASUMI_INCLUDED in the SILEX_HWCONF_INCL_IPS_HW_CFG register */
#define SILEX_HWCONF_INCL_IPS_HW_CFG_Msk      _UINT32_(0x00003FFF)                                 /* (SILEX_HWCONF_INCL_IPS_HW_CFG) Register Mask  */


/* -------- SILEX_HWCONF_BA411E_AES_HW_CFG_1 : (SILEX Offset: 0x404) ( R/ 32)  -------- */
#define SILEX_HWCONF_BA411E_AES_HW_CFG_1_RESETVALUE _UINT32_(0x00)                                       /*  (SILEX_HWCONF_BA411E_AES_HW_CFG_1)   Reset Value */

#define SILEX_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MODE_Pos _UINT32_(0)                                          /* (SILEX_HWCONF_BA411E_AES_HW_CFG_1) Generic g_AesModesPoss value. BA411E-AES engine configuration. Position */
#define SILEX_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MODE_Msk (_UINT32_(0x1FF) << SILEX_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MODE_Pos) /* (SILEX_HWCONF_BA411E_AES_HW_CFG_1) Generic g_AesModesPoss value. BA411E-AES engine configuration. Mask */
#define SILEX_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MODE(value) (SILEX_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MODE_Msk & (_UINT32_(value) << SILEX_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MODE_Pos)) /* Assigment of value for BA411E_AES_HW_CFG_MODE in the SILEX_HWCONF_BA411E_AES_HW_CFG_1 register */
#define SILEX_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_CS_Pos _UINT32_(16)                                         /* (SILEX_HWCONF_BA411E_AES_HW_CFG_1) Generic g_CS value. BA411E-AES engine configuration. Position */
#define SILEX_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_CS_Msk (_UINT32_(0x1) << SILEX_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_CS_Pos) /* (SILEX_HWCONF_BA411E_AES_HW_CFG_1) Generic g_CS value. BA411E-AES engine configuration. Mask */
#define SILEX_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_CS(value) (SILEX_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_CS_Msk & (_UINT32_(value) << SILEX_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_CS_Pos)) /* Assigment of value for BA411E_AES_HW_CFG_CS in the SILEX_HWCONF_BA411E_AES_HW_CFG_1 register */
#define SILEX_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MASKING_Pos _UINT32_(17)                                         /* (SILEX_HWCONF_BA411E_AES_HW_CFG_1) Generic g_UseMasking value. BA411E-AES engine configuration. Position */
#define SILEX_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MASKING_Msk (_UINT32_(0x1) << SILEX_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MASKING_Pos) /* (SILEX_HWCONF_BA411E_AES_HW_CFG_1) Generic g_UseMasking value. BA411E-AES engine configuration. Mask */
#define SILEX_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MASKING(value) (SILEX_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MASKING_Msk & (_UINT32_(value) << SILEX_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_MASKING_Pos)) /* Assigment of value for BA411E_AES_HW_CFG_MASKING in the SILEX_HWCONF_BA411E_AES_HW_CFG_1 register */
#define SILEX_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_KEYSIZE_Pos _UINT32_(24)                                         /* (SILEX_HWCONF_BA411E_AES_HW_CFG_1) Generic g_Keysize value. BA411E-AES engine configuration. Position */
#define SILEX_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_KEYSIZE_Msk (_UINT32_(0x7) << SILEX_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_KEYSIZE_Pos) /* (SILEX_HWCONF_BA411E_AES_HW_CFG_1) Generic g_Keysize value. BA411E-AES engine configuration. Mask */
#define SILEX_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_KEYSIZE(value) (SILEX_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_KEYSIZE_Msk & (_UINT32_(value) << SILEX_HWCONF_BA411E_AES_HW_CFG_1_BA411E_AES_HW_CFG_KEYSIZE_Pos)) /* Assigment of value for BA411E_AES_HW_CFG_KEYSIZE in the SILEX_HWCONF_BA411E_AES_HW_CFG_1 register */
#define SILEX_HWCONF_BA411E_AES_HW_CFG_1_Msk  _UINT32_(0x070301FF)                                 /* (SILEX_HWCONF_BA411E_AES_HW_CFG_1) Register Mask  */


/* -------- SILEX_HWCONF_BA411E_AES_HW_CFG_2 : (SILEX Offset: 0x408) ( R/ 32) Generic g_CtrSize value. BA411E-AES engine configuration. -------- */
#define SILEX_HWCONF_BA411E_AES_HW_CFG_2_RESETVALUE _UINT32_(0x00)                                       /*  (SILEX_HWCONF_BA411E_AES_HW_CFG_2) Generic g_CtrSize value. BA411E-AES engine configuration.  Reset Value */

