Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_tcp_client/src/packs/WBZ653_DFP/component/silex.h
#define SILEX_RNG_CONTROL_FIFODEPTH_FIFODEPTH_Pos _UINT32_(0)                                          /* (SILEX_RNG_CONTROL_FIFODEPTH) Maximum number of 32 bits words that can be stored in the FIFO: 2**g_fifodepth. Position */
#define SILEX_RNG_CONTROL_FIFODEPTH_FIFODEPTH_Msk (_UINT32_(0xFFFFFFFF) << SILEX_RNG_CONTROL_FIFODEPTH_FIFODEPTH_Pos) /* (SILEX_RNG_CONTROL_FIFODEPTH) Maximum number of 32 bits words that can be stored in the FIFO: 2**g_fifodepth. Mask */
#define SILEX_RNG_CONTROL_FIFODEPTH_FIFODEPTH(value) (SILEX_RNG_CONTROL_FIFODEPTH_FIFODEPTH_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_FIFODEPTH_FIFODEPTH_Pos)) /* Assigment of value for FIFODEPTH in the SILEX_RNG_CONTROL_FIFODEPTH register */
#define SILEX_RNG_CONTROL_FIFODEPTH_Msk       _UINT32_(0xFFFFFFFF)                                 /* (SILEX_RNG_CONTROL_FIFODEPTH) Register Mask  */


/* -------- SILEX_RNG_CONTROL_KEY0 : (SILEX Offset: 0x1010) (R/W 32) Key register (MSB). -------- */
#define SILEX_RNG_CONTROL_KEY0_RESETVALUE     _UINT32_(0x00)                                       /*  (SILEX_RNG_CONTROL_KEY0) Key register (MSB).  Reset Value */

#define SILEX_RNG_CONTROL_KEY0_KEY0_Pos       _UINT32_(0)                                          /* (SILEX_RNG_CONTROL_KEY0) Key register (MSB). Position */
#define SILEX_RNG_CONTROL_KEY0_KEY0_Msk       (_UINT32_(0xFFFFFFFF) << SILEX_RNG_CONTROL_KEY0_KEY0_Pos) /* (SILEX_RNG_CONTROL_KEY0) Key register (MSB). Mask */
#define SILEX_RNG_CONTROL_KEY0_KEY0(value)    (SILEX_RNG_CONTROL_KEY0_KEY0_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_KEY0_KEY0_Pos)) /* Assigment of value for KEY0 in the SILEX_RNG_CONTROL_KEY0 register */
#define SILEX_RNG_CONTROL_KEY0_Msk            _UINT32_(0xFFFFFFFF)                                 /* (SILEX_RNG_CONTROL_KEY0) Register Mask  */


/* -------- SILEX_RNG_CONTROL_KEY1 : (SILEX Offset: 0x1014) (R/W 32) Key register. -------- */
#define SILEX_RNG_CONTROL_KEY1_RESETVALUE     _UINT32_(0x00)                                       /*  (SILEX_RNG_CONTROL_KEY1) Key register.  Reset Value */

#define SILEX_RNG_CONTROL_KEY1_KEY1_Pos       _UINT32_(0)                                          /* (SILEX_RNG_CONTROL_KEY1) Key register. Position */
#define SILEX_RNG_CONTROL_KEY1_KEY1_Msk       (_UINT32_(0xFFFFFFFF) << SILEX_RNG_CONTROL_KEY1_KEY1_Pos) /* (SILEX_RNG_CONTROL_KEY1) Key register. Mask */
#define SILEX_RNG_CONTROL_KEY1_KEY1(value)    (SILEX_RNG_CONTROL_KEY1_KEY1_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_KEY1_KEY1_Pos)) /* Assigment of value for KEY1 in the SILEX_RNG_CONTROL_KEY1 register */
#define SILEX_RNG_CONTROL_KEY1_Msk            _UINT32_(0xFFFFFFFF)                                 /* (SILEX_RNG_CONTROL_KEY1) Register Mask  */


/* -------- SILEX_RNG_CONTROL_KEY2 : (SILEX Offset: 0x1018) (R/W 32) Key register. -------- */
#define SILEX_RNG_CONTROL_KEY2_RESETVALUE     _UINT32_(0x00)                                       /*  (SILEX_RNG_CONTROL_KEY2) Key register.  Reset Value */

#define SILEX_RNG_CONTROL_KEY2_KEY2_Pos       _UINT32_(0)                                          /* (SILEX_RNG_CONTROL_KEY2) Key register. Position */
#define SILEX_RNG_CONTROL_KEY2_KEY2_Msk       (_UINT32_(0xFFFFFFFF) << SILEX_RNG_CONTROL_KEY2_KEY2_Pos) /* (SILEX_RNG_CONTROL_KEY2) Key register. Mask */
#define SILEX_RNG_CONTROL_KEY2_KEY2(value)    (SILEX_RNG_CONTROL_KEY2_KEY2_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_KEY2_KEY2_Pos)) /* Assigment of value for KEY2 in the SILEX_RNG_CONTROL_KEY2 register */
#define SILEX_RNG_CONTROL_KEY2_Msk            _UINT32_(0xFFFFFFFF)                                 /* (SILEX_RNG_CONTROL_KEY2) Register Mask  */


/* -------- SILEX_RNG_CONTROL_KEY3 : (SILEX Offset: 0x101C) (R/W 32) Key register (LSB). -------- */
#define SILEX_RNG_CONTROL_KEY3_RESETVALUE     _UINT32_(0x00)                                       /*  (SILEX_RNG_CONTROL_KEY3) Key register (LSB).  Reset Value */

#define SILEX_RNG_CONTROL_KEY3_KEY3_Pos       _UINT32_(0)                                          /* (SILEX_RNG_CONTROL_KEY3) Key register (LSB). Position */
#define SILEX_RNG_CONTROL_KEY3_KEY3_Msk       (_UINT32_(0xFFFFFFFF) << SILEX_RNG_CONTROL_KEY3_KEY3_Pos) /* (SILEX_RNG_CONTROL_KEY3) Key register (LSB). Mask */
#define SILEX_RNG_CONTROL_KEY3_KEY3(value)    (SILEX_RNG_CONTROL_KEY3_KEY3_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_KEY3_KEY3_Pos)) /* Assigment of value for KEY3 in the SILEX_RNG_CONTROL_KEY3 register */
#define SILEX_RNG_CONTROL_KEY3_Msk            _UINT32_(0xFFFFFFFF)                                 /* (SILEX_RNG_CONTROL_KEY3) Register Mask  */


/* -------- SILEX_RNG_CONTROL_TESTDATA : (SILEX Offset: 0x1020) ( /W 32) Test data register. -------- */
#define SILEX_RNG_CONTROL_TESTDATA_RESETVALUE _UINT32_(0x00)                                       /*  (SILEX_RNG_CONTROL_TESTDATA) Test data register.  Reset Value */

#define SILEX_RNG_CONTROL_TESTDATA_TESTDATA_Pos _UINT32_(0)                                          /* (SILEX_RNG_CONTROL_TESTDATA) Test data register. Position */
#define SILEX_RNG_CONTROL_TESTDATA_TESTDATA_Msk (_UINT32_(0xFFFFFFFF) << SILEX_RNG_CONTROL_TESTDATA_TESTDATA_Pos) /* (SILEX_RNG_CONTROL_TESTDATA) Test data register. Mask */
#define SILEX_RNG_CONTROL_TESTDATA_TESTDATA(value) (SILEX_RNG_CONTROL_TESTDATA_TESTDATA_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_TESTDATA_TESTDATA_Pos)) /* Assigment of value for TESTDATA in the SILEX_RNG_CONTROL_TESTDATA register */
#define SILEX_RNG_CONTROL_TESTDATA_Msk        _UINT32_(0xFFFFFFFF)                                 /* (SILEX_RNG_CONTROL_TESTDATA) Register Mask  */


/* -------- SILEX_RNG_CONTROL_REPEATTHRESHOLD : (SILEX Offset: 0x1024) (R/W 32) Repetition Test Count Cut-Off value. -------- */
#define SILEX_RNG_CONTROL_REPEATTHRESHOLD_RESETVALUE _UINT32_(0x00)                                       /*  (SILEX_RNG_CONTROL_REPEATTHRESHOLD) Repetition Test Count Cut-Off value.  Reset Value */

#define SILEX_RNG_CONTROL_REPEATTHRESHOLD_REPEATTHRESHOLD_Pos _UINT32_(0)                                          /* (SILEX_RNG_CONTROL_REPEATTHRESHOLD) Repetition Test Count Cut-Off value. Position */
#define SILEX_RNG_CONTROL_REPEATTHRESHOLD_REPEATTHRESHOLD_Msk (_UINT32_(0xFFFFFFFF) << SILEX_RNG_CONTROL_REPEATTHRESHOLD_REPEATTHRESHOLD_Pos) /* (SILEX_RNG_CONTROL_REPEATTHRESHOLD) Repetition Test Count Cut-Off value. Mask */
#define SILEX_RNG_CONTROL_REPEATTHRESHOLD_REPEATTHRESHOLD(value) (SILEX_RNG_CONTROL_REPEATTHRESHOLD_REPEATTHRESHOLD_Msk & (_UINT32_(value) << SILEX_RNG_CONTROL_REPEATTHRESHOLD_REPEATTHRESHOLD_Pos)) /* Assigment of value for REPEATTHRESHOLD in the SILEX_RNG_CONTROL_REPEATTHRESHOLD register */
#define SILEX_RNG_CONTROL_REPEATTHRESHOLD_Msk _UINT32_(0xFFFFFFFF)                                 /* (SILEX_RNG_CONTROL_REPEATTHRESHOLD) Register Mask  */


