Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/tcpip_tcp_client/src/packs/WBZ653_DFP/component/silex.h
/* -------- SILEX_RNG_DATA_REPEATTHRESHOLD : (SILEX Offset: 0x4024) (R/W 32) Repetition Test Count Cut-Off value. -------- */
#define SILEX_RNG_DATA_REPEATTHRESHOLD_RESETVALUE _UINT32_(0x00)                                       /*  (SILEX_RNG_DATA_REPEATTHRESHOLD) Repetition Test Count Cut-Off value.  Reset Value */

#define SILEX_RNG_DATA_REPEATTHRESHOLD_REPEATTHRESHOLD_Pos _UINT32_(0)                                          /* (SILEX_RNG_DATA_REPEATTHRESHOLD) Repetition Test Count Cut-Off value. Position */
#define SILEX_RNG_DATA_REPEATTHRESHOLD_REPEATTHRESHOLD_Msk (_UINT32_(0xFFFFFFFF) << SILEX_RNG_DATA_REPEATTHRESHOLD_REPEATTHRESHOLD_Pos) /* (SILEX_RNG_DATA_REPEATTHRESHOLD) Repetition Test Count Cut-Off value. Mask */
#define SILEX_RNG_DATA_REPEATTHRESHOLD_REPEATTHRESHOLD(value) (SILEX_RNG_DATA_REPEATTHRESHOLD_REPEATTHRESHOLD_Msk & (_UINT32_(value) << SILEX_RNG_DATA_REPEATTHRESHOLD_REPEATTHRESHOLD_Pos)) /* Assigment of value for REPEATTHRESHOLD in the SILEX_RNG_DATA_REPEATTHRESHOLD register */
#define SILEX_RNG_DATA_REPEATTHRESHOLD_Msk    _UINT32_(0xFFFFFFFF)                                 /* (SILEX_RNG_DATA_REPEATTHRESHOLD) Register Mask  */


/* -------- SILEX_RNG_DATA_PROPTHRESHOLD : (SILEX Offset: 0x4028) (R/W 32) Adaptive Proportion Test (1024-sample window) Cut-Off value. -------- */
#define SILEX_RNG_DATA_PROPTHRESHOLD_RESETVALUE _UINT32_(0x00)                                       /*  (SILEX_RNG_DATA_PROPTHRESHOLD) Adaptive Proportion Test (1024-sample window) Cut-Off value.  Reset Value */

#define SILEX_RNG_DATA_PROPTHRESHOLD_PROPTHRESHOLD_Pos _UINT32_(0)                                          /* (SILEX_RNG_DATA_PROPTHRESHOLD) Adaptive Proportion Test (1024-sample window) Cut-Off value. Position */
#define SILEX_RNG_DATA_PROPTHRESHOLD_PROPTHRESHOLD_Msk (_UINT32_(0xFFFFFFFF) << SILEX_RNG_DATA_PROPTHRESHOLD_PROPTHRESHOLD_Pos) /* (SILEX_RNG_DATA_PROPTHRESHOLD) Adaptive Proportion Test (1024-sample window) Cut-Off value. Mask */
#define SILEX_RNG_DATA_PROPTHRESHOLD_PROPTHRESHOLD(value) (SILEX_RNG_DATA_PROPTHRESHOLD_PROPTHRESHOLD_Msk & (_UINT32_(value) << SILEX_RNG_DATA_PROPTHRESHOLD_PROPTHRESHOLD_Pos)) /* Assigment of value for PROPTHRESHOLD in the SILEX_RNG_DATA_PROPTHRESHOLD register */
#define SILEX_RNG_DATA_PROPTHRESHOLD_Msk      _UINT32_(0xFFFFFFFF)                                 /* (SILEX_RNG_DATA_PROPTHRESHOLD) Register Mask  */


/* -------- SILEX_RNG_DATA_STATUS : (SILEX Offset: 0x4030) (R/W 32) Status register. -------- */
#define SILEX_RNG_DATA_STATUS_RESETVALUE      _UINT32_(0x00)                                       /*  (SILEX_RNG_DATA_STATUS) Status register.  Reset Value */

#define SILEX_RNG_DATA_STATUS_TESTDATABUSY_Pos _UINT32_(0)                                          /* (SILEX_RNG_DATA_STATUS) High when data written to TestData register is being processed. (see section 4.7) Position */
#define SILEX_RNG_DATA_STATUS_TESTDATABUSY_Msk (_UINT32_(0x1) << SILEX_RNG_DATA_STATUS_TESTDATABUSY_Pos) /* (SILEX_RNG_DATA_STATUS) High when data written to TestData register is being processed. (see section 4.7) Mask */
#define SILEX_RNG_DATA_STATUS_TESTDATABUSY(value) (SILEX_RNG_DATA_STATUS_TESTDATABUSY_Msk & (_UINT32_(value) << SILEX_RNG_DATA_STATUS_TESTDATABUSY_Pos)) /* Assigment of value for TESTDATABUSY in the SILEX_RNG_DATA_STATUS register */
#define SILEX_RNG_DATA_STATUS_STATE_Pos       _UINT32_(1)                                          /* (SILEX_RNG_DATA_STATUS) State of the control FSM: 000: Reset, 001: Startup, 010: Idle (Rings On), 011: Idle (Rings Off), 100: Fill FIFO, 101: Error, 110: Unused, 111: Unused. Position */
#define SILEX_RNG_DATA_STATUS_STATE_Msk       (_UINT32_(0x7) << SILEX_RNG_DATA_STATUS_STATE_Pos)   /* (SILEX_RNG_DATA_STATUS) State of the control FSM: 000: Reset, 001: Startup, 010: Idle (Rings On), 011: Idle (Rings Off), 100: Fill FIFO, 101: Error, 110: Unused, 111: Unused. Mask */
#define SILEX_RNG_DATA_STATUS_STATE(value)    (SILEX_RNG_DATA_STATUS_STATE_Msk & (_UINT32_(value) << SILEX_RNG_DATA_STATUS_STATE_Pos)) /* Assigment of value for STATE in the SILEX_RNG_DATA_STATUS register */
#define SILEX_RNG_DATA_STATUS_REPFAIL_Pos     _UINT32_(4)                                          /* (SILEX_RNG_DATA_STATUS) NIST-800-90B repetition Count Test interrupt status. Position */
#define SILEX_RNG_DATA_STATUS_REPFAIL_Msk     (_UINT32_(0x1) << SILEX_RNG_DATA_STATUS_REPFAIL_Pos) /* (SILEX_RNG_DATA_STATUS) NIST-800-90B repetition Count Test interrupt status. Mask */
#define SILEX_RNG_DATA_STATUS_REPFAIL(value)  (SILEX_RNG_DATA_STATUS_REPFAIL_Msk & (_UINT32_(value) << SILEX_RNG_DATA_STATUS_REPFAIL_Pos)) /* Assigment of value for REPFAIL in the SILEX_RNG_DATA_STATUS register */
#define SILEX_RNG_DATA_STATUS_PROPFAIL_Pos    _UINT32_(5)                                          /* (SILEX_RNG_DATA_STATUS) NIST-800-90B adaptive Proportion Test (1024-sample window) interrupt status. Position */
#define SILEX_RNG_DATA_STATUS_PROPFAIL_Msk    (_UINT32_(0x1) << SILEX_RNG_DATA_STATUS_PROPFAIL_Pos) /* (SILEX_RNG_DATA_STATUS) NIST-800-90B adaptive Proportion Test (1024-sample window) interrupt status. Mask */
#define SILEX_RNG_DATA_STATUS_PROPFAIL(value) (SILEX_RNG_DATA_STATUS_PROPFAIL_Msk & (_UINT32_(value) << SILEX_RNG_DATA_STATUS_PROPFAIL_Pos)) /* Assigment of value for PROPFAIL in the SILEX_RNG_DATA_STATUS register */
#define SILEX_RNG_DATA_STATUS_FULLINT_Pos     _UINT32_(7)                                          /* (SILEX_RNG_DATA_STATUS) FIFO full status. Position */
#define SILEX_RNG_DATA_STATUS_FULLINT_Msk     (_UINT32_(0x1) << SILEX_RNG_DATA_STATUS_FULLINT_Pos) /* (SILEX_RNG_DATA_STATUS) FIFO full status. Mask */
#define SILEX_RNG_DATA_STATUS_FULLINT(value)  (SILEX_RNG_DATA_STATUS_FULLINT_Msk & (_UINT32_(value) << SILEX_RNG_DATA_STATUS_FULLINT_Pos)) /* Assigment of value for FULLINT in the SILEX_RNG_DATA_STATUS register */
#define SILEX_RNG_DATA_STATUS_PREINT_Pos      _UINT32_(8)                                          /* (SILEX_RNG_DATA_STATUS) AIS31 preliminary noise alarm interrupt status. Position */
#define SILEX_RNG_DATA_STATUS_PREINT_Msk      (_UINT32_(0x1) << SILEX_RNG_DATA_STATUS_PREINT_Pos)  /* (SILEX_RNG_DATA_STATUS) AIS31 preliminary noise alarm interrupt status. Mask */
#define SILEX_RNG_DATA_STATUS_PREINT(value)   (SILEX_RNG_DATA_STATUS_PREINT_Msk & (_UINT32_(value) << SILEX_RNG_DATA_STATUS_PREINT_Pos)) /* Assigment of value for PREINT in the SILEX_RNG_DATA_STATUS register */
#define SILEX_RNG_DATA_STATUS_ALMINT_Pos      _UINT32_(9)                                          /* (SILEX_RNG_DATA_STATUS) AIS31 noise alarm interrupt status. Position */
#define SILEX_RNG_DATA_STATUS_ALMINT_Msk      (_UINT32_(0x1) << SILEX_RNG_DATA_STATUS_ALMINT_Pos)  /* (SILEX_RNG_DATA_STATUS) AIS31 noise alarm interrupt status. Mask */
#define SILEX_RNG_DATA_STATUS_ALMINT(value)   (SILEX_RNG_DATA_STATUS_ALMINT_Msk & (_UINT32_(value) << SILEX_RNG_DATA_STATUS_ALMINT_Pos)) /* Assigment of value for ALMINT in the SILEX_RNG_DATA_STATUS register */
#define SILEX_RNG_DATA_STATUS_STARTUPFAIL_Pos _UINT32_(10)                                         /* (SILEX_RNG_DATA_STATUS) Start-up test failure. Position */
#define SILEX_RNG_DATA_STATUS_STARTUPFAIL_Msk (_UINT32_(0x1) << SILEX_RNG_DATA_STATUS_STARTUPFAIL_Pos) /* (SILEX_RNG_DATA_STATUS) Start-up test failure. Mask */
#define SILEX_RNG_DATA_STATUS_STARTUPFAIL(value) (SILEX_RNG_DATA_STATUS_STARTUPFAIL_Msk & (_UINT32_(value) << SILEX_RNG_DATA_STATUS_STARTUPFAIL_Pos)) /* Assigment of value for STARTUPFAIL in the SILEX_RNG_DATA_STATUS register */
#define SILEX_RNG_DATA_STATUS_FIFOACCFAIL_Pos _UINT32_(11)                                         /* (SILEX_RNG_DATA_STATUS) Set when a FIFO data read is performed while the NDRNG is disabled AND has its FIFO empty (FIFOLevel = 0). Position */
#define SILEX_RNG_DATA_STATUS_FIFOACCFAIL_Msk (_UINT32_(0x1) << SILEX_RNG_DATA_STATUS_FIFOACCFAIL_Pos) /* (SILEX_RNG_DATA_STATUS) Set when a FIFO data read is performed while the NDRNG is disabled AND has its FIFO empty (FIFOLevel = 0). Mask */
#define SILEX_RNG_DATA_STATUS_FIFOACCFAIL(value) (SILEX_RNG_DATA_STATUS_FIFOACCFAIL_Msk & (_UINT32_(value) << SILEX_RNG_DATA_STATUS_FIFOACCFAIL_Pos)) /* Assigment of value for FIFOACCFAIL in the SILEX_RNG_DATA_STATUS register */
#define SILEX_RNG_DATA_STATUS_Msk             _UINT32_(0x00000FBF)                                 /* (SILEX_RNG_DATA_STATUS) Register Mask  */


/* -------- SILEX_RNG_DATA_INITWAITVAL : (SILEX Offset: 0x4034) (R/W 32) Initial wait counter value. -------- */
#define SILEX_RNG_DATA_INITWAITVAL_RESETVALUE _UINT32_(0xFFFF)                                     /*  (SILEX_RNG_DATA_INITWAITVAL) Initial wait counter value.  Reset Value */

#define SILEX_RNG_DATA_INITWAITVAL_INITWAITVAL_Pos _UINT32_(0)                                          /* (SILEX_RNG_DATA_INITWAITVAL) Number of clock cycles to wait before sampling data from the noise source. Position */
#define SILEX_RNG_DATA_INITWAITVAL_INITWAITVAL_Msk (_UINT32_(0xFFFF) << SILEX_RNG_DATA_INITWAITVAL_INITWAITVAL_Pos) /* (SILEX_RNG_DATA_INITWAITVAL) Number of clock cycles to wait before sampling data from the noise source. Mask */
#define SILEX_RNG_DATA_INITWAITVAL_INITWAITVAL(value) (SILEX_RNG_DATA_INITWAITVAL_INITWAITVAL_Msk & (_UINT32_(value) << SILEX_RNG_DATA_INITWAITVAL_INITWAITVAL_Pos)) /* Assigment of value for INITWAITVAL in the SILEX_RNG_DATA_INITWAITVAL register */
#define SILEX_RNG_DATA_INITWAITVAL_Msk        _UINT32_(0x0000FFFF)                                 /* (SILEX_RNG_DATA_INITWAITVAL) Register Mask  */


/* -------- SILEX_RNG_DATA_DISABLEOSC0 : (SILEX Offset: 0x4038) (R/W 32) Disable oscillator rings #0 to #31. -------- */
#define SILEX_RNG_DATA_DISABLEOSC0_RESETVALUE _UINT32_(0x00)                                       /*  (SILEX_RNG_DATA_DISABLEOSC0) Disable oscillator rings #0 to #31.  Reset Value */

#define SILEX_RNG_DATA_DISABLEOSC0_DISABLEOSC0_Pos _UINT32_(0)                                          /* (SILEX_RNG_DATA_DISABLEOSC0) Disable oscillator rings #0 to #31. Position */
#define SILEX_RNG_DATA_DISABLEOSC0_DISABLEOSC0_Msk (_UINT32_(0xFFFFFFFF) << SILEX_RNG_DATA_DISABLEOSC0_DISABLEOSC0_Pos) /* (SILEX_RNG_DATA_DISABLEOSC0) Disable oscillator rings #0 to #31. Mask */
#define SILEX_RNG_DATA_DISABLEOSC0_DISABLEOSC0(value) (SILEX_RNG_DATA_DISABLEOSC0_DISABLEOSC0_Msk & (_UINT32_(value) << SILEX_RNG_DATA_DISABLEOSC0_DISABLEOSC0_Pos)) /* Assigment of value for DISABLEOSC0 in the SILEX_RNG_DATA_DISABLEOSC0 register */
#define SILEX_RNG_DATA_DISABLEOSC0_Msk        _UINT32_(0xFFFFFFFF)                                 /* (SILEX_RNG_DATA_DISABLEOSC0) Register Mask  */


/* -------- SILEX_RNG_DATA_DISABLEOSC1 : (SILEX Offset: 0x403C) (R/W 32) Disable oscillator rings #32 to #63. -------- */
#define SILEX_RNG_DATA_DISABLEOSC1_RESETVALUE _UINT32_(0x00)                                       /*  (SILEX_RNG_DATA_DISABLEOSC1) Disable oscillator rings #32 to #63.  Reset Value */

#define SILEX_RNG_DATA_DISABLEOSC1_DISABLEOSC1_Pos _UINT32_(0)                                          /* (SILEX_RNG_DATA_DISABLEOSC1) Disable oscillator rings #32 to #63. Position */
#define SILEX_RNG_DATA_DISABLEOSC1_DISABLEOSC1_Msk (_UINT32_(0xFFFFFFFF) << SILEX_RNG_DATA_DISABLEOSC1_DISABLEOSC1_Pos) /* (SILEX_RNG_DATA_DISABLEOSC1) Disable oscillator rings #32 to #63. Mask */
#define SILEX_RNG_DATA_DISABLEOSC1_DISABLEOSC1(value) (SILEX_RNG_DATA_DISABLEOSC1_DISABLEOSC1_Msk & (_UINT32_(value) << SILEX_RNG_DATA_DISABLEOSC1_DISABLEOSC1_Pos)) /* Assigment of value for DISABLEOSC1 in the SILEX_RNG_DATA_DISABLEOSC1 register */
#define SILEX_RNG_DATA_DISABLEOSC1_Msk        _UINT32_(0xFFFFFFFF)                                 /* (SILEX_RNG_DATA_DISABLEOSC1) Register Mask  */


/* -------- SILEX_RNG_DATA_SWOFFTMRVAL : (SILEX Offset: 0x4040) (R/W 32) Switch off timer value. -------- */
#define SILEX_RNG_DATA_SWOFFTMRVAL_RESETVALUE _UINT32_(0x00)                                       /*  (SILEX_RNG_DATA_SWOFFTMRVAL) Switch off timer value.  Reset Value */

#define SILEX_RNG_DATA_SWOFFTMRVAL_SWOFFTMRVAL_Pos _UINT32_(0)                                          /* (SILEX_RNG_DATA_SWOFFTMRVAL) Number of clk cycles to wait before stopping the rings after the FIFO is full. Position */
#define SILEX_RNG_DATA_SWOFFTMRVAL_SWOFFTMRVAL_Msk (_UINT32_(0xFFFF) << SILEX_RNG_DATA_SWOFFTMRVAL_SWOFFTMRVAL_Pos) /* (SILEX_RNG_DATA_SWOFFTMRVAL) Number of clk cycles to wait before stopping the rings after the FIFO is full. Mask */
#define SILEX_RNG_DATA_SWOFFTMRVAL_SWOFFTMRVAL(value) (SILEX_RNG_DATA_SWOFFTMRVAL_SWOFFTMRVAL_Msk & (_UINT32_(value) << SILEX_RNG_DATA_SWOFFTMRVAL_SWOFFTMRVAL_Pos)) /* Assigment of value for SWOFFTMRVAL in the SILEX_RNG_DATA_SWOFFTMRVAL register */
#define SILEX_RNG_DATA_SWOFFTMRVAL_Msk        _UINT32_(0x0000FFFF)                                 /* (SILEX_RNG_DATA_SWOFFTMRVAL) Register Mask  */


/* -------- SILEX_RNG_DATA_CLKDIV : (SILEX Offset: 0x4044) (R/W 32) Sample clock divider. -------- */
#define SILEX_RNG_DATA_CLKDIV_RESETVALUE      _UINT32_(0x00)                                       /*  (SILEX_RNG_DATA_CLKDIV) Sample clock divider.  Reset Value */

